#+STARTUP: hidestars
#+TITLE: Using Emacs, Org-mode and R for Research Writing in Social Sciences
#+SUBTITLE: A Toolkit for Writing Reproducible Research Papers and Monographs
#+AUTHOR: Vikas Rawal
#+COLUMNS: %25ITEM %TAGS %PRIORITY %T
#+OPTIONS: H:4 toc:2 num:2
#+LaTeX_CLASS: vmemoir
#+LATEX_CLASS_OPTIONS: [oneside,openany,strict,extrafontsizes,article,garamond]
#+INCLUDE: default_packages.org
#+LATEX_HEADER: \linespread{1.3}
#+LATEX_HEADER: \renewcommand{\TPTminimum}{\linewidth}
#+LATEX_HEADER: \usepackage{tabularx,siunitx,booktabs}
#+LATEX_HEADER: \newcolumntype{C}{>{\centering\arraybackslash}X}
#+LATEX_HEADER: \newcommand{\mconx}[1]{\multicolumn{1}{C}{#1}}
#+LATEX_HEADER: \newcommand{\mcx}[2]{\multicolumn{#1}{>{\hsize=\dimexpr #1\hsize +\numexpr2*#1-2\relax\tabcolsep \relax}C}{#2}}
#+LATEX_HEADER: \newcolumntype{d}[1]{D{.}{\cdot}{#1}}
#+LATEX_HEADER: \newcommand{\mcone}[1]{\multicolumn{1}{C}{#1}}
#+MACRO: MCONE @@latex:\mcone{$1}@@
#+MACRO: MCD @@latex:\multicolumn{1}{c}{$1}@@

*** Sample code

We shall directly create only those tables in Org that present content
not being produced through statistical analysis. For tables that are
created through statistical analysis, we shall embed R programs rather
than the tables themselves. This is discussed in Section [[#orgmodeandr]]
of this guide.

The following sample code produces a reasonably formatted table, with
a numbered title above the table and a name for cross-referencing the
table from the text anywhere in the document.

See Table [[table-yield]] for an illustration of how this table shows
up in the final document.

#+NAME: one
#+BEGIN_SRC org :results replace drawer
,#+NAME: table-yield
,#+CAPTION: Simple table created using LaTeX tabular environment
,#+attr_latex: :environment tabular :width \textwidth :align lrr
    | State          | Average yield | Average income |
    |----------------+---------------+----------------|
    | Madhya Pradesh |           672 |          13000 |
    | Haryana        |           300 |          25000 |
    | Punjab         |           260 |          35000 |
#+End_SRC

#+RESULTS: one
:RESULTS:
#+NAME: table-yield
#+CAPTION: Simple table created using LaTeX tabular environment
#+attr_latex: :environment tabular :width \textwidth :align lrr
    | State          | Average yield | Average income |
    |----------------+---------------+----------------|
    | Madhya Pradesh |           672 |          13000 |
    | Haryana        |           300 |          25000 |
    | Punjab         |           260 |          35000 |
:END:

*** Formatting tables using LaTeX tabulary package

Package ~tabulary~ extends the ~tabular~ environment by providing
three additional column types. It is relatively easy to integrate this
package into orgmode.

Table [[tabulary-column-types]] shows different types of columns available
in ~tabulary~ package.

#+NAME: tabulary-column-types
#+CAPTION: Types of columns in LaTeX tabulary package
#+attr_latex: :environment tabulary :width \textwidth :align lL :booktabs t
| Type | Description                  |
|------+------------------------------|
| l    | Left aligned, no wrapping    |
| L    | Left aligned with wrapping   |
| r    | Right aligned, no wrapping   |
| R    | Right aligned with wrapping  |
| c    | Centre aligned, no wrapping  |
| C    | Centre aligned with wrapping |
| J    | Justified and wrapped        |

Load tabulary and booktabs using the following line in the preamble.

~#+LATEX_HEADER: \usepackage{tabulary,booktabs}~

Following ~#+attr_latex~ lines illustrate the way of declaring that
the table should be constructed using ~tabulary~ and passing various
options to it:

: #+attr_latex: :environment tabulary :width 0.8\textwidth :align @{}L|llR@{}
: #+attr_latex: :center :booktabs t

:width is used to specify the /maximum/ total width of the table that
the table can take [it may be specified as ~\textwidth~, implying full
text width, as ~0.8\textwidth~, implying a fraction (0.8 here) of the
text width, in centimeters (like, 10cm) or in inches (like, 5in)].
Note that, in =tabulary=, the width is the maximum width of the whole
table. If your columns do not need the entire width that you specify,
the table turns out narrower than the width.

~:align~ specifies how to render each columns by using one letter
(l,L,r,R,c,C or J) for each column. The number of letters should
exactly match the number of columns in your table. A ~|~ anywhere
implies a vertical line. ~@{}~ before and after the columns removes a
slight default indentation that LaTeX tabulars insert in the first and
last columns.

~:booktabs t~ gives us nice horizontal lines.

The following code uses tabulary to create a table. The output of the code is shown in Table [[tabulary-yield-out]].

#+NAME: tabulary-in
#+BEGIN_SRC org :results replace drawer
  ,#+NAME: tabulary-yield-out
  ,#+CAPTION: Table formatted using tabulary package
  ,#+ATTR_LATEX: :environment tabulary :width \textwidth :align @{}lRR@{}
  ,#+ATTR_LATEX: :center t :booktabs t :float t
     | State          | Average yield | Average income |
     |----------------+---------------+----------------|
     | Madhya Pradesh |           669 |       13121.25 |
     | Haryana        |           300 |        2532.30 |
     | Punjab         |           260 |       35232.45 |
#+End_SRC

#+RESULTS: tabulary-in
:RESULTS:
#+NAME: tabulary-yield-out
#+CAPTION: Table formatted using tabulary package
#+ATTR_LATEX: :environment tabulary :width \textwidth :align @{}lRR@{}
#+ATTR_LATEX: :center t :booktabs t :float t
   | State          | Average yield | Average income |
   |----------------+---------------+----------------|
   | Madhya Pradesh |           669 |       13121.25 |
   | Haryana        |           300 |        2532.30 |
   | Punjab         |           260 |       35232.45 |
:END:

